In [7]:
import pandas as pd
import numpy as np

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
titles = pd.read_csv('imdb_pandas/titles.csv')
titles.head(10)

                            title  year
0                  The Rising Son  1990
1         The Thousand Plane Raid  1969
2                Crucea de piatra  1993
3                         Country  2000
4                      Gaiking II  2011
5                     Medusa (IV)  2015
6  The Fresh Air Will Do You Good  2008
7              Alex in Wonderland  1970
8                      L'outsider  2016
9          Do Outro Lado do Mundo  2008

In [3]:
cast = pd.read_csv('imdb_pandas/cast.csv')
cast.head(10)

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,NaN
6,Straight Outta Compton,2015,$hutter,actor,Dopeman,NaN
7,For Thy Love 2,2009,Bee Moe $lim,actor,Thug 1,NaN
8,"Lapis, Ballpen at Diploma, a True to Life Journey",2014,Jori ' Danilo' Jurado Jr.,actor,Jaime (young),9.0
9,Desire (III),2014,Syaiful 'Ariffin,actor,Actor Playing Eteocles from 'Antigone',NaN

### Using groupby(), count the number of films that have been released in each decade in the history of cinema.

In [49]:
titles.groupby(pd.cut(titles['year'], np.arange(1890,2030,10))).count()['title']

year
(1890, 1900]        7
(1900, 1910]       55
(1910, 1920]     7617
(1920, 1930]     8490
(1930, 1940]    10277
(1940, 1950]     8675
(1950, 1960]    13113
(1960, 1970]    18166
(1970, 1980]    18351
(1980, 1990]    20746
(1990, 2000]    22672
(2000, 2010]    42247
(2010, 2020]    61847
Name: title, dtype: int64

### Use groupby() count the number of "Hamlet" films made in each decade.

In [54]:
ham = titles[titles['title'] == 'Hamlet']
ham.groupby(pd.cut(ham['year'], np.arange(1890,2030,10))).count()['year']

year
(1890, 1900]    0
(1900, 1910]    1
(1910, 1920]    2
(1920, 1930]    1
(1930, 1940]    0
(1940, 1950]    1
(1950, 1960]    1
(1960, 1970]    2
(1970, 1980]    2
(1980, 1990]    2
(1990, 2000]    2
(2000, 2010]    1
(2010, 2020]    3
Name: year, dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [56]:
actors = cast[(cast['year'].between(1950,1959, inclusive =True)) 
     & (cast['type'] == 'actor') & (cast['n'] == 1)]
actors.groupby(pd.cut(actors['year'], np.arange(1950,1959,1))).count()['year']

year
(1950, 1951]    647
(1951, 1952]    607
(1952, 1953]    652
(1953, 1954]    634
(1954, 1955]    641
(1955, 1956]    643
(1956, 1957]    735
(1957, 1958]    710
Name: year, dtype: int64

In [57]:
actress = cast[(cast['year'].between(1950,1959, inclusive =True)) 
     & (cast['type'] == 'actress') & (cast['n'] == 1)]
actress.groupby(pd.cut(actress['year'], np.arange(1950,1959,1))).count()['year']

year
(1950, 1951]    281
(1951, 1952]    293
(1952, 1953]    301
(1953, 1954]    310
(1954, 1955]    281
(1955, 1956]    305
(1956, 1957]    301
(1957, 1958]    295
Name: year, dtype: int64

### In the 1950s taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [66]:
n_5 = cast[(cast['year'].between(1950,1959, inclusive =True)) 
     & (cast['type'] == 'actress')]
n_5.loc[n_5['n'].isin([1,2,3,4,5])].count()['character']

16062

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [131]:
PP = cast[cast['title'] == 'The Pink Panther']
PP.sort_values('n').groupby(['year'])[['n']].max()

         n
year
1963  15.0
2006  50.0

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [134]:
frank = cast[cast['name'] == 'Frank Oz']
f2 = frank.groupby(['year', 'title'])[['title']].size()
f2[f2>1]

year  title
1979  The Muppet Movie                        8
1981  An American Werewolf in London          2
      The Great Muppet Caper                  6
1982  The Dark Crystal                        2
1984  The Muppets Take Manhattan              7
1985  Follow That Bird                        3
1992  The Muppet Christmas Carol              7
1996  Muppet Treasure Island                  4
1999  Muppets from Space                      4
      The Adventures of Elmo in Grouchland    3
dtype: int64

### List each of the characters that Frank Oz has portrayed at least twice.

In [141]:
f3 = frank.groupby('character')[['character']].size()
f3[f3>2]

character
Animal            6
Bert              3
Cookie Monster    3
Fozzie Bear       4
Miss Piggy        6
Sam the Eagle     5
Yoda              6
dtype: int64